Revit 2026 API

# FabricWireItem Class

---

Provides implementation for FabricWires stored in a Custom Fabric Sheet

SystemObject Autodesk.Revit.DB.StructureFabricWireItem

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FabricWireItem : IDisposable
```
```vb
Public Class FabricWireItem
	Implements IDisposable
```
```cpp
public ref class FabricWireItem : IDisposable
```
```fsharp
type FabricWireItem =
    class
        interface IDisposable
    end
```

The FabricWireItem type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Distance | Distance to the next fabric wire item Can be 0 to be used with offset along wire. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | OffsetAlongWire | Offset along wire direction Wire distance should be 0 if we want to be along the same wire |
|  | WireLength | Wire length for this wire item |
|  | WireType | The wire type of this wire item |

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new instance of a single Fabric wire. |
|  | Dispose | Releases all resources used by the FabricWireItem |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Structure Namespace